src/InformationRegisters/кфкИсходящиеСообщения/кфкИсходящиеСообщения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="9bb60e0f-842a-4fa4-ac2b-edd89101fe4a">
  <name>кфкИсходящиеСообщения</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="6b53242f-90ec-4441-929d-e40a10912da1">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="645be078-31fe-4466-b372-8bb9bfa3f5be">
    <name>ИсходныеДанные</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="c8b56203-f691-4ecb-baa5-349014dc183d">
    <name>ЭтоУдаление</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="219a3ae5-d22d-467d-b06a-ac34b1cb0b28">
    <name>КлючСообщения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>64</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="afab001f-7c73-48bc-8796-c31e7bf52af0">
    <name>Заголовки</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="bb437059-733a-4568-833f-93a08c527b14">
    <name>ТелоСообщения</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <attributes extendedConfigurationObject="edf8a9c9-f606-41ee-a73e-b96b0e7cca2a">
    <name>Продюсер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="999a4a8e-9e06-4003-bef9-df9a1040dd3c">
    <name>ТипОбъект</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>120</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="292b6eec-1780-46e7-8559-9493aa1ddb42">
    <name>ТипИсходныхДанных</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>120</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="c7c42290-9fd9-47f2-aab1-06ebdfba17ce">
    <name>КлючОбъекта</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>64</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="46012b4d-4b78-4cbd-8d0d-18101a391f7f">
    <name>СобытиеРегистрации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="95dd5ec5-8b2e-459f-a936-2a5d2be7b2a4">
    <name>ДатаРегистрации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="28f1a3aa-a8a0-404d-97be-3f9ebb177a1a">
    <name>ДатаОбработки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ee05bfa3-5c0b-4ad6-962d-b2ec05fed003">
    <name>ДатаВыгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e799e980-8ada-4039-a30c-da9f60bebb2d">
    <name>ДлОбработкиМС</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="a856e5db-41c4-4e7d-981e-2c56dcb0b477">
    <name>ТекстЖурнала</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6d139c82-f66c-4620-a76a-8cb29ad47bce">
    <name>КоличествоОбработок</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="285c25ea-c7ab-4ec5-b049-028ac1a7e72d">
    <name>КоличествоВыгрузок</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="aa816974-7fec-4c4a-a209-74cbe7e41026">
    <name>МеткаИзменения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>30</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <dimensions extendedConfigurationObject="bc51b526-bde0-4420-be0b-4163f25aa1ed">
    <name>КлючЗаписи</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>64</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions extendedConfigurationObject="dcea6dff-ee4d-4454-ab67-2dff64dc7131">
    <name>МеткаРегистрации</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>30</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/кфкСобытияРегистрации/кфкСобытияРегистрации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="5f962ff8-8042-41d2-b1ec-caaafc280953">
  <name>кфкСобытияРегистрации</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="0fbf150a-0471-429a-8475-4dd177ffe512">
    <name>ПриЗаписи</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="b98d3d58-06fd-4afd-bee4-142bedb6bfc9">
    <name>Программно</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="b0c1ff5f-7922-4a31-908a-5420fd19b9e2">
    <name>Принудительно</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

src/Enums/кфкСтатусыСообщений/кфкСтатусыСообщений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="90c87861-83c3-4174-81dd-550f291515d7">
  <name>кфкСтатусыСообщений</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="e87ed46a-b4fe-41ad-a05b-c7d43a993d59">
    <name>Новое</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="4aa47c21-1293-47d6-b3ab-9d29a043b1dc">
    <name>Обработано</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="82907498-6643-4090-a81d-dd1982638a68">
    <name>ОбработкаОтменена</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="bb65cb4f-750e-4084-b787-633ed9393166">
    <name>ОшибкаОбработки</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="31aa5e8e-008e-4e64-bdea-a9307ad0bcc1">
    <name>Выгружено</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="2aad9bb4-aca4-411a-8268-a2c8d7a9efe8">
    <name>ОшибкаВыгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="b1566b75-70c6-497a-8ff6-bdaa91eddbbe">
    <name>ВыгрузкаОтменена</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

src/CommonModules/Обр_кфкРегистрацияИзменений_ММ/Module.bsl
#Область ПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт
	
	ЮТТесты
		.ВТранзакции()
		.ДобавитьТестовыйНабор(
			"Обработка кфкРегистрацияИзменений. Модуль менеджера. ВыполнитьРегистрациюСсылочногоТипа()")
			.Тег("Модульные")
			.Тег("кфкРегистрацияИзменений")
			.Тег("ВыполнитьРегистрациюСсылочногоТипа")
			.ДобавитьСерверныйТест("ВыполнитьРегистрациюСсылочногоТипа_РегистрируетСсылку",
				"ВыполнитьРегистрациюСсылочногоТипа(). Регистрирует ссылку объекта")
				.Тег("РегистрируетСсылку")
			.ДобавитьСерверныйТест("ВыполнитьРегистрациюСсылочногоТипа_РегистрируетОбъект",
				"ВыполнитьРегистрациюСсылочногоТипа(). Регистрирует объект")
				.Тег("РегистрируетОбъект")
		.ДобавитьТестовыйНабор(
			"Обработка кфкРегистрацияИзменений. Модуль менеджера. ВыполнитьРегистрациюНезависимогоРегистра()")
			.Тег("Модульные")
			.Тег("кфкРегистрацияИзменений")
			.Тег("ВыполнитьРегистрациюНезависимогоРегистра")
			.ДобавитьСерверныйТест("ВыполнитьРегистрациюНезависимогоРегистра_РегистрируетЗапись",
				"ВыполнитьРегистрациюНезависимогоРегистра(). Регистрирует запись")
				.Тег("РегистрируетЗапись")
		.ДобавитьТестовыйНабор(
			"Обработка кфкРегистрацияИзменений. Модуль менеджера. ВыполнитьРегистрациюПодчиненногоРегистра()")
			.Тег("Модульные")
			.Тег("кфкРегистрацияИзменений")
			.Тег("ВыполнитьРегистрациюПодчиненногоРегистра")
			.ДобавитьСерверныйТест("ВыполнитьРегистрациюПодчиненногоРегистра_РегистрируетРегистратор",
				"ВыполнитьРегистрациюПодчиненногоРегистра(). Регистрирует регистратор")
				.Тег("РегистрируетРегистратор");
	
КонецПроцедуры

Процедура ВыполнитьРегистрациюСсылочногоТипа_РегистрируетСсылку() Экспорт
	
	Ссылка = СоздатьЭлементТестовогоСправочника();
	Продюсер = кфк_т_ТестовыеДанные.СсылкаПродюсераСправочника();
	ОписаниеЗапроса = ОписаниеЗапросаСсылочногоТипа(Ссылка);
	
	Обработки.кфкРегистрацияИзменений.ВыполнитьРегистрациюСсылочногоТипа(
		ОписаниеЗапроса, Продюсер, Ложь);
	
	ПроверитьСообщениеОчереди(
		Продюсер,
		"Справочник.кфк_т_ТестовыйСправочник",
		"CatalogRef.кфк_т_ТестовыйСправочник",
		XMLСтрока(Ссылка));
	
КонецПроцедуры

Процедура ВыполнитьРегистрациюСсылочногоТипа_РегистрируетОбъект() Экспорт
	
	Ссылка = СоздатьЭлементТестовогоСправочника();
	Продюсер = кфк_т_ТестовыеДанные.СсылкаПродюсераСправочника();
	ОписаниеЗапроса = ОписаниеЗапросаСсылочногоТипа(Ссылка);
	
	Обработки.кфкРегистрацияИзменений.ВыполнитьРегистрациюСсылочногоТипа(
		ОписаниеЗапроса, Продюсер, Истина);
	
	ПроверитьСообщениеОчереди(
		Продюсер,
		"Справочник.кфк_т_ТестовыйСправочник",
		"CatalogObject.кфк_т_ТестовыйСправочник",
		XMLСтрока(Ссылка));
	
КонецПроцедуры

Процедура ВыполнитьРегистрациюНезависимогоРегистра_РегистрируетЗапись() Экспорт
	
	Идентификатор = Строка(Новый УникальныйИдентификатор);
	ТестоваяСсылка = СоздатьЭлементТестовогоСправочника();
	Продюсер = кфк_т_ТестовыеДанные.СсылкаПродюсераРегистра();
	
	Запись = РегистрыСведений.кфк_т_ТестовыйРегистрСведений.СоздатьМенеджерЗаписи();
	Запись.Период = ТекущаяДатаСеанса();
	Запись.ТестоваяСсылка = ТестоваяСсылка;
	Запись.Булево = Истина;
	Запись.Строка = "Тестовая запись";
	Запись.Число = 42;
	Запись.ДатаИВремя = ТекущаяДатаСеанса();
	Запись.Идентификатор = Новый УникальныйИдентификатор;
	Запись.Комментарий = Идентификатор;
	Запись.Записать();
	
	ОписаниеЗапроса = ОписаниеЗапросаНезависимогоРегистра(Идентификатор);
	Обработки.кфкРегистрацияИзменений.ВыполнитьРегистрациюНезависимогоРегистра(
		ОписаниеЗапроса, Продюсер);
	
	ПроверитьСообщениеОчереди(
		Продюсер,
		"РегистрСведений.кфк_т_ТестовыйРегистрСведений",
		"InformationRegisterRecordSet.кфк_т_ТестовыйРегистрСведений");
	
КонецПроцедуры

Процедура ВыполнитьРегистрациюПодчиненногоРегистра_РегистрируетРегистратор() Экспорт
	
	Регистратор = ЮТест.Данные()
		.КонструкторОбъекта(Документы.кфк_т_ТестовыйДокумент)
		.Установить("Дата", ТекущаяДатаСеанса())
		.Установить("Комментарий", "Регистратор пакетной регистрации")
		.Записать();
	Продюсер = кфк_т_ТестовыеДанные.СсылкаПродюсераРегистраПР();
	
	НаборЗаписей = РегистрыСведений.кфк_т_ТестовыйРегистрСведенийПР.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(Регистратор);
	Запись = НаборЗаписей.Добавить();
	Запись.Период = ТекущаяДатаСеанса();
	Запись.Идентификатор = Строка(Новый УникальныйИдентификатор);
	Запись.Значение = 84;
	НаборЗаписей.Записать();
	
	ОписаниеЗапроса = ОписаниеЗапросаПодчиненногоРегистра(Регистратор);
	Обработки.кфкРегистрацияИзменений.ВыполнитьРегистрациюПодчиненногоРегистра(
		ОписаниеЗапроса, Продюсер);
	
	ПроверитьСообщениеОчереди(
		Продюсер,
		"РегистрСведений.кфк_т_ТестовыйРегистрСведенийПР",
		"InformationRegisterRecordSet.кфк_т_ТестовыйРегистрСведенийПР");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СоздатьЭлементТестовогоСправочника()
	
	Возврат ЮТест.Данные()
		.КонструкторОбъекта(Справочники.кфк_т_ТестовыйСправочник)
		.Установить("Наименование", "Элемент для пакетной регистрации")
		.Записать();
	
КонецФункции

Функция ОписаниеЗапросаСсылочногоТипа(Ссылка)
	
	ТекстЗапроса = "ВЫБРАТЬ
	|	ТестовыйСправочник.Ссылка
	|ИЗ
	|	Справочник.кфк_т_ТестовыйСправочник КАК ТестовыйСправочник
	|ГДЕ
	|	ТестовыйСправочник.Ссылка = &Ссылка";
	
	Возврат Новый Структура(
		"ИмяТаблицы,Текст,Параметры",
		"Справочник.кфк_т_ТестовыйСправочник",
		ТекстЗапроса,
		Новый Структура("Ссылка", Ссылка));
	
КонецФункции

Функция ОписаниеЗапросаНезависимогоРегистра(Комментарий)
	
	ТекстЗапроса = "ВЫБРАТЬ
	|	ТестовыйРегистр.Период,
	|	ТестовыйРегистр.ТестоваяСсылка,
	|	ТестовыйРегистр.Булево,
	|	ТестовыйРегистр.Строка,
	|	ТестовыйРегистр.Число,
	|	ТестовыйРегистр.ДатаИВремя,
	|	ТестовыйРегистр.Идентификатор,
	|	ТестовыйРегистр.Комментарий
	|ИЗ
	|	РегистрСведений.кфк_т_ТестовыйРегистрСведений КАК ТестовыйРегистр
	|ГДЕ
	|	ТестовыйРегистр.Комментарий = &Комментарий";
	
	Возврат Новый Структура(
		"ИмяТаблицы,Текст,Параметры",
		"РегистрСведений.кфк_т_ТестовыйРегистрСведений",
		ТекстЗапроса,
		Новый Структура("Комментарий", Комментарий));
	
КонецФункции

Функция ОписаниеЗапросаПодчиненногоРегистра(Регистратор)
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТестовыйРегистр.Регистратор
	|ИЗ
	|	РегистрСведений.кфк_т_ТестовыйРегистрСведенийПР КАК ТестовыйРегистр
	|ГДЕ
	|	ТестовыйРегистр.Регистратор = &Регистратор";
	
	Возврат Новый Структура(
		"ИмяТаблицы,Текст,Параметры",
		"РегистрСведений.кфк_т_ТестовыйРегистрСведенийПР",
		ТекстЗапроса,
		Новый Структура("Регистратор", Регистратор));
	
КонецФункции

Процедура ПроверитьСообщениеОчереди(
		Продюсер,
		ТипОбъекта,
		ТипИсходныхДанных,
		КлючОбъекта = Неопределено)
	
	Предикат = ЮТест.Предикат()
		.Реквизит("Продюсер").Равно(Продюсер)
		.Реквизит("ТипОбъект").Равно(ТипОбъекта)
		.Реквизит("ТипИсходныхДанных").Равно(ТипИсходныхДанных)
		.Реквизит("СобытиеРегистрации").Равно(
			Перечисления.кфкСобытияРегистрации.Принудительно)
		.Реквизит("Статус").Равно(
			Перечисления.кфкСтатусыСообщений.Новое);
	Если КлючОбъекта <> Неопределено Тогда
		Предикат.Реквизит("КлючОбъекта").Равно(КлючОбъекта);
	КонецЕсли;
	
	ЮТест.ОжидаетЧтоТаблицаБазы(
		"РегистрСведений.кфкИсходящиеСообщения",
		"Принудительно зарегистрированное исходящее сообщение")
		.СодержитТолькоОднуЗапись(Предикат);
	
КонецПроцедуры

#КонецОбласти
